https://dict.revised.moe.edu.tw/page.jsp?ID=33
教育部《重編國語辭典修訂本》
到主要頁面
系統選單::: 最新消息 編輯說明 網站導覽 使用說明 常見問題 EN 👨 ⚙️
教育部《重編國語辭典修訂本》
關鍵字檢索
字典選單基本檢索進階檢索部首索引辭典附錄
::: 首頁 > 使用說明
使用說明
進入主畫面後，其各項功能訊息簡介如下。

 

一、上方功能列

本網站上方功能列，包括：「最新消息」、「編輯說明」、「網站導覽」、「使用說明」、「常見問題」、「中英文版本切換」、「會員登入」、「功能設定」等。

《重編國語辭典修訂本》上方功能列

 

二、中央主功能列

本網站中央主功能列，包括：「基本檢索」、「進階檢索」、「部首索引」、「辭典附錄」等，各功能分述如下：

 

(一) 基本檢索

1. 關鍵字檢索

步驟 1：

01.輸入關鍵字，可輸入中文，或利用系統小鍵盤功能輸入注音、漢語拼音。

02.系統出現候選字清單，可點選候選清單字詞，或自行輸入關鍵字。

03.選擇搜尋範圍，可複選。

04.點選「檢索」進行搜尋。

例：輸入「教育」→勾選查詢範圍「詞目」、「相似詞」→點選「檢索」。

基本檢索搜尋說明

步驟 2：

01.檢視檢索結果列表。

02.可依「音序(升冪)」或「字數(升冪)」作排序。

03.可調整每頁顯示則數。

04.當搜尋範圍包含「詞目」時，將一併檢索附錄資料，可透過點選頁籤切換進入「正文」或「附錄」資料。

檢索結果列表頁面說明

步驟 3：檢視正文詞條內容頁

01.點選結果列表字詞欄，進入正文詞條內容頁。

02.可選當頁書籤快速跳至各說解欄位。

03.可設定當頁字級大小。

04.可列印當頁詞條說解內容。

05.可點選「意見回饋」進入本典常見問題表單頁面。

06.可點選詞目中的各單字，直接進入該單字內容頁。

07.如該單字內容頁屬多音單字，可於該頁注音欄點選注音，直接進入含該多音單字的相關複詞列表。

基本檢索內容頁

字詞內容頁之再檢索功能說明

步驟 4：檢視附錄資料內容頁

01.點選附錄頁籤，進入附錄資料結果列表。

02.系統跳出說明視窗提醒將進入附錄資料，可選擇之後不顯示。

03.點選結果列表字詞欄進入附錄資料內容頁。

附錄資料瀏覽說明視窗

附錄資料結果表

2. 義類檢索

步驟 1：

01.輸入中文關鍵字。

02.系統出現候選字清單，可點選候選清單字詞，或自行輸入關鍵字。

03.點選「義類檢索」。

04.點選「檢索」進行搜尋。

例：輸入「人才」→勾點選「義類檢索」→點選「檢索」。

義類檢索功能說明

步驟 2：

01.檢視檢索結果列表。

02.可依「音序(升冪)」或「字數(升冪)」作排序。

03.可調整每頁顯示則數。

義類檢索結果列表

步驟 3：相關功能說明同關鍵字檢索步驟3。

 

(二) 進階檢索

1. 關鍵字設定：選擇以下其中一種方式設定關鍵字。

步驟 1：「輸入關鍵字」

01.輸入關鍵字字形。

02.如關鍵字具多音且僅欲查詢其中某音時，可於關鍵字字形後輸入半形空格，另行輸入欲查詢的音讀。

關鍵字檢索之字形輸入
步驟 2：「形構查詢」

01.輸入關鍵字包含的形構，系統將自動列出候選字清單。

02.如該候選字為多音字，系統將另行標示字音。

03.點選欲查詢關鍵字，系統將自動帶入關鍵字輸入框。

關鍵字檢索之形構輸入
步驟 3：「總筆畫數查詢」

01.選擇關鍵字總筆劃數。

02.選擇部首筆畫，進入下一流程；也可點ALL，直接列出候選字清單。

03.選擇「部首」，系統將自動列出候選字清單。

04.如為多音字則系統將另行標示字音，點選欲查詢關鍵字後將自動帶入關鍵字輸入框。

關鍵字檢索之總筆畫輸入
2. 縮小檢索範圍：選填。

步驟 1：「位置」，擇一輸入

01.選擇關鍵字位置，單選，選項包括：不限、詞首、詞中、詞尾。

02.或直接輸入關鍵字位於詞中的位序，如：第1個字。

進階檢索之位置輸入
步驟 2：「字數」

01.輸入欲檢索詞的字數區段，如2個字至5個字。

02.起始數字必填，結尾數字可不填。

進階檢索之字數輸入
3. 檢索條件設定完成後，點選「檢索」送出搜尋，並檢視檢索結果列表。

檢索結果列表

 

(三) 部首索引

步驟 1：選擇部首筆畫

步驟 2：選擇是否「顯示部首注音」、「顯示變形部首」，並選擇部首

步驟 3：選擇部首外筆畫，或可選擇ALL設定全選

步驟 4：選擇欲查詢的字

步驟 5：檢視檢索結果列表及詞條內容頁

部首檢索功能說明
部首檢索內容頁

 

(四) 辭典附錄

步驟 1：選擇欲瀏覽附錄資料項目

步驟 2：進入附錄項目後，由上至下依序為：附錄說明、索引及附加功能、資料內容(依各附錄特性有所差異)

步驟 3：可選擇索引功能瀏覽特定資料

步驟 4：可選擇每頁顯示擇數

辭典附錄目錄頁

辭典附錄內容頁

 

三、其他主要功能

本網站其他主要功能，包括：「會員功能」、「意見交流」等，分述如下：

 

(一) 會員功能

1. 會員註冊

步驟 1：點選上方功能列「會員登入」

步驟 2：點選「註冊新帳號」

會員註冊頁面

步驟 3：點選「同意」

會員註冊規章同意畫面
步驟 4：填寫註冊資料後，點選「註冊」。

會員註冊資料填寫頁面

步驟 5：收到認證信後，點擊啟用連結後即可直接導引至會員區塊。

會員註冊確認信

 

2. 密碼修改

步驟 1：輸入「新密碼」及「確認密碼」

步驟 2：點選「修改」

密碼修改說明

3. 忘記密碼

步驟 1：點選上方功能列「會員登入」

步驟 2：點選「忘記密碼」

忘記密申請畫面
步驟 3：輸入使用者註冊之信箱，點選「重設密碼」

忘記密碼申請畫面
步驟 4：收到確認信後，點擊連結即可進入會員區塊重設密碼。

忘記密碼確認信
  

4. 字詞瀏覽紀錄表

步驟 1：會員登入後，系統將主動記錄使用者曾點入結果頁面字詞

步驟 2：字詞瀏覽紀錄表依瀏覽時間由新至舊排序，可直接點選進入該字詞內容頁面

步驟 3：可點選「清除紀錄」，手動刪除列表紀錄

字詞瀏覽紀錄表

  

5. 功能設定

步驟 1：會員登入後，使用者可進行個人化設定

步驟 2：依需求點選字詞內頁字型為「大」、「中」、「小」後，系統將自動生效並儲存

功能設定頁面

 

(二) 意見交流

步驟 1：點選正文詞條內容頁「意見回饋」或下方功能列「意見交流」，即可進入本典常見問題表單

步驟 2：點選頁面上方頁籤可快速跳至該問題類型首要問題

步驟 3：如常見問題表單無適用答案，可點選頁面浮標「意見回饋」進入意見回饋表填寫頁面

意見交流頁面

意見回饋表單頁面

 

四、有關「非系統字表」

 

(一) 部分較罕用的系統字型不在預設顯示範圍內，建議您更改個人單機系統字顯示範圍，以增加顯示字數。更改設定後，若仍有無法顯示的字型，則請嘗試於「非系統字表」中查找。

 

(二) 增加系統字顯示字數的設定步驟如下：

1. Windows 7 開啟擴充字元集

步驟 1：在注音輸入法圖示點選鼠標右鍵 > 選「設定值」

在注音輸入法圖式點選鼠標右鍵 後，選「設定值」。

步驟 2：一般 > 已安裝的服務> 鍵盤 > 點選「中文(繁體)-新注音」 > 點選「內容」。

一般，點已安裝的服務，點鍵盤，點選「中文(繁體)-新注音」，點選「內容」。

步驟 3：一般 > 輸出設定 > 點選「字元集設定」。

一般，點輸出設定，點選「字元集設定」

步驟 4：勾選以下 > 確定。
(1) Unicode字元(擴充B字元)
    (2) 包含香港增補字符集字元(H)
    (3) 允許使用中文標準交換碼全字庫(CNS11643)所定義的字根輸入(C)

勾選以下，點確定。

 

2. Windows 10 開啟擴充字元集

步驟 1：在注音輸入法圖示點選鼠標右鍵 > 選「內容」。

在注音輸入法圖示點選鼠標右鍵，選「內容」

步驟 2：一般 > 輸出設定 > 選「字元集設定」。

一般，點輸出設定，選「字元集設定」

步驟 3：勾選以下 > 確定。
(1) Unicode字元(擴充B字元)
    (2) 包含香港增補字符集字元(H)
    (3) 包含更多中文標準交換碼全字庫(CNS11643)所定義的字元

勾選下列紅框處，點確定。

 

︿
回頂端
《重編國語辭典修訂本》臺灣學術網路第六版 中華民國教育部版權所有
國家教育研究院
下方選單::: 個資法及隱私聲明 | 辭典公眾授權網 | 意見交流 | 網網相連
三峽總院區地址：新北市三峽區三樹路2號、 臺北院區地址：臺北市大安區和平東路一段179號、 臺中院區地址：臺中市豐原區師範街67號 電話總機：(02)7740-7890、 傳真：(02)7740-7064、 TANet VoIP：9009-7890
通過AA檢測等級無障礙網頁檢測 在線人數: 1215
累積總人次: 385,457,945